In [1]:
import numpy as np
import pandas as pd

In [2]:
data={
    "Name":['John', "Anna","Peter", "Linda"],
    'Age':[28,34, 29, 42],
    'City':['New York',"Paris","Berlin", "London"],
    'Salary':[65000, 70000, 62000, 85000]
}
df=pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [3]:
data_list=[
    ['John',28,'New York',65000 ],
    ["Anna",34,"Paris",70000 ],
    ["Peter",29,"Berlin",62000], 
    ["Linda",42,"London",85000]
]
column=["Name","Age","City","Salary"]
row=[1,2,3,4]
df2=pd.DataFrame(data_list,columns=column)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [4]:
df2['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [5]:
df2[['Name','City']] #selecting columns

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [6]:
df2.loc[[0,1]] #selecting rows

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [7]:
df2["Designation"]=["Doctor","Eng","Doctor","Eng"]
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000         Eng
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000         Eng

In [8]:
df2.drop('Designation',axis=1)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [12]:
df2.drop("Designation",axis=1,inplace=True)

In [13]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [9]:
df2.iloc[[0,1]][["City","Salary"]]# selecting subset of rows and columns

       City  Salary
0  New York   65000
1     Paris   70000

In [14]:
df2[(df2["Age"]>30) & (df2["City"]=="Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000